import random

sasha = []
for i in range(10):
	sasha.append(random.randint(1, 100))
for i in sasha:
	print(i + 1)


#Задание
#Создать список из десяти целых чисел.
#Вывести на экран каждое число, увеличенное на 1.