#Задание
#Ввести с клавиатуры строку.
#Вывести эту же строку вертикально: по одному символу на строку консоли.

x = str(input())
for i in x:
	print(i)